tutorials/testcases/flowOverCylinder/Re3900/3d_transient_coarse/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0.35355   0.35355  0     ) // 0
    ( 1.060660  1.060660 0     ) // 1
    (-1.060660  1.060660 0     ) // 2
    (-0.35355   0.35355  0     ) // 3
    ( 0.35355   0.35355  3.1415) // 4
    ( 1.060660  1.060660 3.1415) // 5
    (-1.060660  1.060660 3.1415) // 6
    (-0.35355   0.35355  3.1415) // 7
    (-1.060660 -1.060660 0     ) // 8
    (-0.35355  -0.35355  0     ) // 9
    (-1.060660 -1.060660 3.1415) //10
    (-0.35355  -0.35355  3.1415) //11
    ( 1.060660 -1.060660 0     ) //12
    ( 0.35355  -0.35355  0     ) //13
    ( 1.060660 -1.060660 3.1415) //14
    ( 0.35355  -0.35355  3.1415) //15

    (-15   -15   0     ) //16
    ( 15   -15   0     ) //17
    ( 15    15   0     ) //18
    (-15    15   0     ) //19
    (-15   -15   3.1415) //20
    ( 15   -15   3.1415) //21
    ( 15    15   3.1415) //22
    (-15    15   3.1415) //23
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) inner (42 60 32) simpleGrading (3.0 1 1)
    hex ( 3  2  8  9  7  6 10 11) inner (42 60 32) simpleGrading (3.0 1 1)
    hex ( 9  8 12 13 11 10 14 15) inner (42 60 32) simpleGrading (3.0 1 1)
    hex (13 12  1  0 15 14  5  4) inner (42 60 32) simpleGrading (3.0 1 1)

    hex (16 17 18 19 20 21 22 23) outer (50 50 2) simpleGrading (1 1 1)
);

edges
(
    arc  0  3 ( 0    0.5 0     )
    arc  1  2 ( 0    1.5 0     )
    arc  4  7 ( 0    0.5 3.1415)
    arc  5  6 ( 0    1.5 3.1415)

    arc  3  9 (-0.5  0   0     )
    arc  2  8 (-1.5  0   0     )
    arc  7 11 (-0.5  0   3.1415)
    arc  6 10 (-1.5  0   3.1415)

    arc  9 13 ( 0   -0.5 0     )
    arc  8 12 ( 0   -1.5 0     )
    arc 11 15 ( 0   -0.5 3.1415)
    arc 10 14 ( 0   -1.5 3.1415)

    arc 13  0 ( 0.5  0   0     )
    arc 12  1 ( 1.5  0   0     )
    arc 15  4 ( 0.5  0   3.1415)
    arc 14  5 ( 1.5  0   3.1415)
);

boundary
(
    cylinder
    {
        type wall;
        faces
        (
            ( 0  4  7  3)
            ( 9  3  7 11)
            (13  9 11 15)
            ( 0 13 15  4)
        );
    }

    inner
    {
        type bellerophon;
        donorZone outer;
        faces
        (
            ( 1  2  6  5)
            ( 2  8 10  6)
            ( 8 12 14 10)
            (12  1  5 14)
        );
    }

    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            ( 0  3  2  1)
            ( 3  9  8  2)
            ( 8  9 13 12)
            ( 0  1 12 13)

            (19 18 17 16)
        );
    }

    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (

            ( 4  5  6  7)
            ( 6 10 11  7)
            (10 14 15 11)
            ( 4 15 14  5)

            (20 21 22 23)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (16 20 23 19)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (17 18 22 21)
        );
    }

    sides
    {
        type patch;
        faces
        (
            (16 17 21 20)
            (18 19 23 22)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
