tutorials/testcases/flowOverCylinder/Re3900/3d_transient_coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7680;
        startFace       2115058;
    }
    inner
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          7680;
        startFace       2122738;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       outer;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          33028;
        startFace       2130418;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          33028;
        startFace       2163446;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       2196474;
    }
    outlet
    {
        type            patch;
        nFaces          1348;
        startFace       2196574;
    }
    sides
    {
        type            patch;
        nFaces          200;
        startFace       2197922;
    }
    outer
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          9472;
        startFace       2198122;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       inner;
    }
)

// ************************************************************************* //
